app/controllers/employees_controller.rb

  def create_employee_details
    designation = params[:designation]
    if params[:emp_code].present?
      emp = Employee.find_by_emp_code(params[:emp_code]) || Employee.new(employee_params)
      emp.attributes = employee_params
    else
      emp = Employee.new(employee_params)
    end
    if emp.save
---
SELECT  "employees".* FROM "employees" WHERE "employees"."emp_code" = ? LIMIT ?  [["emp_code", "ACC001"], ["LIMIT", 1]]
INSERT INTO "employees" ("reporter_id", "name", "salary", "rating", "designation", "emp_code") VALUES (?, ?, ?, ?, ?, ?)  [["reporter_id", 1], ["name", "Employee2 VP"], ["salary", 900000], ["rating", 5], ["designation", "VP"], ["emp_code", "ACC002"]]
UPDATE "employees" SET "reporter_id" = ?, "designation" = ? WHERE "employees"."id" = ?  [["reporter_id", 1], ["designation", "VP"], ["id", 2]]

  def delete_employee
    if params[:emp_code].blank?
      render json: {error: 'Please enter employee code'}
    else
      emp = Employee.find_by_emp_code(params[:emp_code])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."emp_code" = ? LIMIT ?  [["emp_code", "ACC005"], ["LIMIT", 1]]